/*
1. Проверка свойства массива целых чисел. Алгоритм проверки должен быть
	эффективным. Проверить, что в массиве только положительные элементы.

2. Удалить в массиве целых чисел первую группу из двух подряд идущих одинаковых
	элементов.

3. Решение задачи оформить в виде рекурсивной функции. Массив содержит
	целые числа. Описать рекурсивную функцию, заменяющую в массиве все
отрицательные элементы на 0.

4. Дана квадратная матрица целых чисел. Если произвести вычисление какого-
	то элемента не удаётся выдать исключение об этом. Найти минимальный элемент среди элементов матрицы, выделенных
	черным цветом (Рисунок 2) больших заданного значения.

5. Дана матрица целых чисел. При решении задачи следует выделять память
	под новый массив. Если произвести вычисление какого-то элемента не
	удаётся выдать исключение об этом. Построить вектор, каждый элемент которого равен среднему
	арифметическому отрицательных элементов соответствующей строки
	матрицы.
*/

#include <iostream>
#include "defs.h"

using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");




	//system("pause");
	return 0;
}